cases/chpt2-Mesh-Trace/system/blockMeshDict
  /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 -5)
    (10 0 -5)
    (10 10 -5)
    (0 10 -5)
    (0 0 5)
    (10 0 5)
    (10 10 5)
    (0 10 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    /*
    sym
    {
        type symmetry;
        faces
        (
        (1 5 4 0)
        );
    }
    top
    {
        type wall;
        faces
        (
        (4 5 6 7)          
        );
    }
    btm
    {
        type wall;
        faces
        (
        (0 3 2 1)
        );
    }
    side1Andside2Andside3
    {
        type wall;
        faces
        (
        (0 4 7 3)        
        (2 6 5 1)
        (3 7 6 2)
        );
    }
    */
    top
    {
        type wall;
        faces
        (
        (1 5 4 0)
        (4 5 6 7)   
        (0 3 2 1)
        (0 4 7 3)        
        (2 6 5 1)
        (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
