cases/chpt2-Mesh-Trace/constant/sourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceVel (-0.001666 0 0);
sourcePos0 (0 0 0.006);
sourcePos1 (0 0 0);
sourcePos2 (0 0 0);
sourceOmega 0.0108;//
sourcePenn  0.0036;//
sourceStartTime 0;
sourcePauseTime 2;
sourceEndTime 1e3;
sourcePower 1890;
sourceC_C 120;//35;//30;//25;
sourceFieldCut 0.01;

sourcePause true;
sourceTwo false;
sourceThree false;
oneMeter 1;